; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite3 - satellite
	instrument11 - instrument
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation14 - direction
	GroundStation8 - direction
	Star2 - direction
	Star7 - direction
	GroundStation12 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation1 - direction
	Star6 - direction
	Star10 - direction
	GroundStation11 - direction
	Star9 - direction
	GroundStation13 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation13)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star10)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation8)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation12)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon17)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph2)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation8)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation12)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 Star2)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 Star6)
	(supports instrument10 image1)
	(calibration_target instrument10 Star10)
	(calibration_target instrument10 Star6)
	(calibration_target instrument10 GroundStation1)
	(calibration_target instrument10 Star5)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation11)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation3)
	(calibration_target instrument11 GroundStation0)
	(calibration_target instrument11 GroundStation13)
	(calibration_target instrument11 Star9)
	(calibration_target instrument11 GroundStation11)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
)
(:goal (and
	(pointing satellite2 GroundStation11)
	(pointing satellite3 Planet16)
	(have_image Planet15 thermograph2)
	(have_image Planet16 image1)
	(have_image Phenomenon17 thermograph2)
	(have_image Star18 thermograph0)
))

)

; plan
1. (turn_to satellite3 planet16 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet16)
   goals met: 2 of 6
2. (turn_to satellite0 star5 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 6
4. (calibrate satellite0 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 2 of 6
5. (turn_to satellite0 planet15 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet15)
   goals met: 2 of 6
6. (take_image satellite0 planet15 instrument2 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 3 of 6
7. (turn_to satellite0 phenomenon17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 6
8. (take_image satellite0 phenomenon17 instrument2 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 4 of 6
9. (turn_to satellite0 planet16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet16)
   goals met: 4 of 6
10. (take_image satellite0 planet16 instrument2 image1)
   added: (have_image planet16 image1)
   goals met: 5 of 6
11. (turn_to satellite0 star18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star18)
   goals met: 5 of 6
12. (take_image satellite0 star18 instrument2 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 6 of 6
